---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyNoAttachedParent
source: html/244b581f-3003-a1b7-6154-3836ed5e1b3f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyNoAttachedParent Property

Attached Detail Group can't be copied without its Model Group

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyNoAttachedParent { get; }
```